<template>
  <component :is="$vuetify.breakpoint.smAndUp?'v-container':'div'" class="publicLayoutContents stickToTop">
    <v-layout row height="200px" justify-center align-center>
      <v-card width="100%" flat>
        <v-card-title primary-title>
          <v-flex xs12>
            <h3 class="headline">개인정보 처리방침</h3>
            <div class="justify-center align-center pa-3">
              <v-flex mt-3>
                <p>&lt;Pedagy&gt;(<a href="https://pedagy.com">https://pedagy.com</a>, 이하 'Pedagy')는 개인정보보호법에 따라 이용자의 개인정보 보호 및 권익을 보호하고 개인정보와 관련한 이용자의 고충을 원활하게 처리할 수 있도록 다음과 같은 처리방침을 두고 있습니다.<br>
                Pedagy는 개인정보처리방침을 개정하는 경우 웹사이트 공지사항(또는 개별공지)을 통하여 공지할 것입니다.<br>
                <br>본 방침은 2019년 2월부터 시행됩니다.</p>
                <br>
                <h3>1. 개인정보의 처리 목적: Pedagy는 개인정보를 다음의 목적을 위해 처리합니다. 처리한 개인정보는 다음의 목적 이외의 용도로는 사용되지 않으며 이용 목적이 변경될 시에는 사전 동의를 구할 예정입니다.</h3><br>
                <h4>Ⅰ. 홈페이지 회원가입 및 관리</h4>
                <h6>회원 가입의사 확인, 회원제 서비스 제공에 따른 본인 식별·인증, 회원자격 유지·관리, 제한적 본인확인제 시행에 따른 본인확인, 서비스 부정이용 방지, 만14세 미만 아동 개인정보 수집 시 가입 시 입력한 전자우편주소를 통한 법정대리인 동의 여부 확인, 각종 고지·통지, 고충처리, 분쟁 조정을 위한 기록 보존 등을 목적으로 개인정보를 처리합니다.</h6>
                <h4>Ⅱ. 민원사무 처리</h4>
                <h6>민원인의 신원 확인, 민원사항 확인, 사실조사를 위한 연락·통지, 처리결과 통보 등을 목적으로 개인정보를 처리합니다.</h6>
                <h4>Ⅲ. 재화 또는 서비스 제공</h4>
                <h6>서비스 제공, 콘텐츠 제공, 맞춤 서비스 제공, 본인인증 등을 목적으로 개인정보를 처리합니다.</h6>
                <h4>Ⅳ. 마케팅 및 광고에의 활용</h4>
                <h6>신규 서비스(제품) 개발 및 맞춤 서비스 제공, 이벤트 및 광고성 정보 제공 및 참여기회 제공, 인구통계학적 특성에 따른 서비스 제공 및 광고 게재, 서비스의 유효성 확인, 접속빈도 파악 또는 회원의 서비스 이용에 대한 통계 등을 목적으로 개인정보를 처리합니다.</h6>

                <h6>&middot;Ⅰ~Ⅳ. 각 호의 내용에 따라 보유 및 처리하는 개인정보 항목: 전자우편주소, 비밀번호, 로그인ID, 서비스 이용 기록, 접속 로그, 쿠키, 접속 IP 정보</h6>
                <h6>&middot;수집 방법: 홈페이지, 서면양식, 생성정보 수집 툴 등을 통한 수집</h6>
                <h6>&middot;보유 근거: 원활한 사이트의 이용을 위한 개인정보 처리 및 수집</h6>
                <h6>&middot;보유 기간: 서비스 탈퇴 혹은 해지 후 3년(단, 전자우편주소 등의 정보는 탈퇴 혹은 해지 후 중복가입 방지 등의 목적으로만 영구 보관)</h6>
                <h6>&middot;관련 법령: 1)신용정보의 수집/처리 및 이용 등에 관한 기록: 3년, 2)소비자의 불만 또는 분쟁처리에 관한 기록: 3년, 3)대금결제 및 재화 등의 공급에 관한 기록: 5년, 4)계약 또는 청약철회 등에 관한 기록: 5년, 5)표시/광고에 관한 기록: 6개월</h6>
                <br>
                <h3>2. 개인정보의 처리 및 보유 기간</h3><br>
                <h4>Ⅰ. Pedagy는 법령에 따른 개인정보 보유·이용기간 또는 정보주체로부터 개인정보를 수집 시 동의 받은 개인정보 보유, 이용기간 내에서 개인정보를 처리, 보유합니다.</h4>
                <h4>Ⅱ. 각각의 개인정보 처리 및 보유 기간은 다음과 같습니다.</h4>
                <h5>가. &lt;홈페이지 회원가입 및 관리&gt;</h5>
                <h6>&lt;홈페이지 회원가입 및 관리&gt;와 관련한 개인정보는 수집, 이용에 관한 동의일로부터3년까지 위 이용목적을 위하여 보유, 이용됩니다.</h6>
                <h6>&middot;보유 근거: 회원 가입 시 필요한 인증을 위한 개인 정보 처리 및 보유 기간</h6>
                <h6>&middot;관련 법령: 1)신용정보의 수집/처리 및 이용 등에 관한 기록: 3년, 2)소비자의 불만 또는 분쟁처리에 관한 기록: 3년, 3)대금결제 및 재화 등의 공급에 관한 기록: 5년, 4)계약 또는 청약철회 등에 관한 기록: 5년, 5)표시/광고에 관한 기록: 6개월</h6>

                <h5>나. &lt;재화 또는 서비스 제공&gt;</h5>
                <h6>&lt;재화 또는 서비스 제공&gt;과 관련한 개인정보는 수집, 이용에 관한 동의일로부터 해지 또는 탈퇴 시까지 위 이용목적을 위하여 보유, 이용됩니다.</h6>
                <h6>&middot;보유 근거: 재화 또는 서비스의 제공을 위해 필요한 개인 정보 처리 및 보유 기간</h6>
                <h6>&middot;관련 법령: 1)신용정보의 수집/처리 및 이용 등에 관한 기록: 3년, 2)소비자의 불만 또는 분쟁처리에 관한 기록: 3년, 3)대금결제 및 재화 등의 공급에 관한 기록: 5년, 4)계약 또는 청약철회 등에 관한 기록: 5년, 5)표시/광고에 관한 기록: 6개월</h6>

                <h5>다. &lt;마케팅 및 광고에의 활용&gt;</h5>
                <h6>&lt;마케팅 및 광고에의 활용&gt;과 관련한 개인정보는 수집, 이용에 관한 동의일로부터3년까지 위 이용목적을 위하여 보유, 이용됩니다.</h6>
                <h6>&middot;보유 근거: 마케팅 및 광고에의 활용을 위해 필요한 개인 정보 처리 및 보유 기간</h6>
                <h6>&middot;관련 법령: 1)신용정보의 수집/처리 및 이용 등에 관한 기록: 3년, 2)소비자의 불만 또는 분쟁처리에 관한 기록: 3년, 3)대금결제 및 재화 등의 공급에 관한 기록: 5년, 4)계약 또는 청약철회 등에 관한 기록: 5년, 5)표시/광고에 관한 기록: 6개월</h6>
                <br>
                <h3>3. 정보주체와 법정대리인의 권리·의무 및 그 행사방법: 이용자는 개인정보주체로써 다음과 같은 권리를 행사할 수 있습니다.</h3><br>
                <h4>Ⅰ. 정보주체는 Pedagy에 대해 언제든지 개인정보 열람, 정정, 삭제, 처리정지 요구 등의 권리를 행사할 수 있습니다.</h4>
                <h4>Ⅱ. 제1항에 따른 권리 행사는 Pedagy에 대해 개인정보 보호법 시행령 제41조제1항에 따라 전자우편 등을 통하여 하실 수 있으며 Pedagy는 이에 대해 지체 없이 조치하겠습니다.</h4>
                <h4>Ⅲ. 제1항에 따른 권리 행사는 정보주체의 법정대리인이나 위임을 받은 자 등 대리인을 통하여 하실 수 있습니다. 이 경우 개인정보 보호법 시행규칙 별지 제11호 서식에 따른 위임장을 제출하셔야 합니다.</h4>
                <h4>Ⅳ. 개인정보 열람 및 처리정지 요구는 개인정보보호법 제35조 제5항, 제37조 제2항에 의하여 정보주체의 권리가 제한 될 수 있습니다.</h4>
                <h4>Ⅴ. 개인정보의 정정 및 삭제 요구는 다른 법령에서 그 개인정보가 수집 대상으로 명시되어 있는 경우에는 그 삭제를 요구할 수 없습니다.</h4>
                <h4>Ⅵ. Pedagy는 정보주체 권리에 따른 열람의 요구, 정정·삭제의 요구, 처리정지의 요구 시 열람 등 요구를 한 자가 본인이거나 정당한 대리인인지를 확인합니다.</h4>
                <br>
                <h3>4. 처리하는 개인정보의 항목 작성</h3><br>
                <h4>Ⅰ. Pedagy는 다음의 개인정보 항목을 처리하고 있습니다.</h4>
                <h5>가. &lt;홈페이지 회원가입 및 관리&gt;</h5>
                <h6>필수 항목: 전자우편주소, 로그인ID</h6>
                <h5>나. &lt;재화 또는 서비스 제공&gt;</h5>
                <h6>필수 항목: 전자우편주소, 로그인ID, 서비스 이용 기록, 접속 로그, 쿠키</h6>
                <br>
                <h3>5. 개인정보의 파기: Pedagy는 원칙적으로 개인정보 처리목적이 달성된 경우에는 지체없이 해당 개인정보를 파기합니다. 파기의 절차, 기한 및 방법은 다음과 같습니다.</h3><br>
                <h4>Ⅰ. 파기절차</h4>
                <h6>이용자가 입력한 정보는 목적 달성 후 별도의 DB에 옮겨져(종이의 경우 별도의 서류) 내부 방침 및 기타 관련 법령에 따라 일정기간 저장된 후 혹은 즉시 파기됩니다. 이 때, DB로 옮겨진 개인정보는 법률에 의한 경우가 아니고서는 다른 목적으로 이용되지 않습니다.</h6>
                <h4>Ⅱ. 파기기한</h4>
                <h6>이용자의 개인정보는 개인정보의 보유기간이 경과된 경우에는 보유기간의 종료일로부터 5일 이내에, 개인정보의 처리 목적 달성, 해당 서비스의 폐지, 사업의 종료 등 그 개인정보가 불필요하게 되었을 때에는 개인정보의 처리가 불필요한 것으로 인정되는 날로부터 5일 이내에 그 개인정보를 파기합니다.</h6>
                <h4>Ⅲ. 파기방법</h4>
                <h6>전자적 파일 형태의 정보는 기록을 재생할 수 없는 기술적 방법을 사용합니다.</h6>
                <br>
                <h3>6. 개인정보 자동 수집 장치의 설치&middot;운영 및 거부에 관한 사항</h3><br>
                <h4>Ⅰ. Pedagy는 개별적인 맞춤서비스를 제공하기 위해 이용정보를 저장하고 수시로 불러오는 ‘쿠키(cookie)’를 사용합니다.</h4>
                <h4>Ⅱ. 쿠키는 웹사이트를 운영하는데 이용되는 서버(http)가 이용자의 컴퓨터 브라우저에게 보내는 소량의 정보이며 이용자들의 PC 컴퓨터내의 하드디스크에 저장되기도 합니다.</h4>
                <h5>가. 쿠키의 사용 목적: 이용자가 방문한 각 서비스와 웹 사이트들에 대한 방문 및 이용형태, 인기 검색어, 보안접속 여부, 등을 파악하여 이용자에게 최적화된 정보 제공을 위해 사용됩니다.</h5>
                <h5>나. 쿠키의 설치&middot;운영 및 거부: 웹브라우저 상단의 도구&gt;인터넷 옵션&gt;개인정보 메뉴의 옵션 설정을 통해 쿠키 저장을 거부 할 수 있습니다.</h5>
                <h5>다. 쿠키 저장을 거부할 경우 맞춤형 서비스 이용에 어려움이 발생할 수 있습니다.</h5>
                <br>
                <h3>7. 개인정보 처리방침 변경</h3><br>
                <h4>Ⅰ. 이 개인정보처리방침은 시행일로부터 적용되며, 법령 및 방침에 따른 변경내용의 추가, 삭제 및 정정이 있는 경우에는 변경사항의 시행 7일 전부터 공지사항을 통하여 고지할 것입니다.</h4>
                <br>
                <h3>8. 개인정보의 안전성 확보 조치: Pedagy는 개인정보보호법 제29조에 따라 다음과 같이 안전성 확보에 필요한 기술적/관리적 및 물리적 조치를 하고 있습니다.</h3><br>
                <h4>Ⅰ. 내부관리계획의 수립 및 시행</h4>
                <h6>개인정보의 안전한 처리를 위하여 내부관리계획을 수립하고 시행하고 있습니다.</h6>
                <h4>Ⅱ. 해킹 등에 대비한 기술적 대책</h4>
                <h6>Pedagy는 해킹이나 컴퓨터 바이러스 등에 의한 개인정보 유출 및 훼손을 막기 위하여 외부로부터 접근이 통제된 구역에 시스템을 설치하고 기술적/물리적으로 감시 및 차단하고 있습니다.</h6>
                <h4>Ⅲ. 개인정보의 암호화</h4>
                <h6>이용자의 개인정보 중 비밀번호는 암호화 되어 저장 및 관리되고 있어, 본인만이 알 수 있으며 중요한 데이터는 파일 및 전송 데이터를 암호화 하거나 파일 잠금 기능을 사용하는 등의 별도 보안기능을 사용하고 있습니다.</h6>
                <h4>Ⅳ. 개인정보에 대한 접근 제한</h4>
                <h6>개인정보를 처리하는 데이터베이스시스템에 대한 접근권한의 부여, 변경, 말소를 통하여 개인정보에 대한 접근통제를 위하여 필요한 조치를 하고 있으며 침입차단시스템을 이용하여 외부로부터의 무단 접근을 통제하고 있습니다.</h6>
                <br>
                <h3>9. 개인정보에 관한 책임자 및 서비스</h3><br>
                <p>Pedagy는 이용자의 개인정보를 보호하고 개인정보와 관련한 불만을 처리하기 위해 만전을 기하고 있습니다. Pedagy를 이용하시면서 발생하는 모든 개인정보 보호 관련 민원을 아래 메일 주소로 신고하실 수 있습니다. Pedagy는 이용자의 신고사항에 대해 신속하게 충분한 답변을 드릴 것입니다.</p>

                <p>개인정보관리책임자: Pedagy 관리자<br>
                전자우편주소: <a href="mailto:webmaster@pedagy.com">webmaster@pedagy.com</a></p>

              </v-flex>
            </div>
          </v-flex>
        </v-card-title>
      </v-card>
    </v-layout>
  </component>
</template>

<script>
import PublicLayout from '../layouts/PublicLayout';
export default {
  created () {
    this.$emit('update:layout', PublicLayout);
  },
  name: 'Privacy'
};
</script>
